; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   yellow_door_1 purple_door_1 red_door_1 grey_door_1 - door
   red_ball_1 purple_ball_1 grey_ball_1 red_ball_4 red_ball_2 red_ball_3 - ball
   yellow_box_1 yellow_box_2 - box
 )
 (:init (agentinroom room_2) (objectinroom red_ball_1 room_1) (objectinroom grey_ball_1 room_2) (objectinroom red_ball_2 room_2) (objectinroom red_ball_3 room_2) (objectinroom red_ball_4 room_2) (objectinroom yellow_box_1 room_3) (objectinroom purple_ball_1 room_3) (objectinroom yellow_box_2 room_4) (objectcolor red_ball_1 redtype) (objectcolor grey_ball_1 greytype) (objectcolor red_ball_2 redtype) (objectcolor red_ball_3 redtype) (objectcolor red_ball_4 redtype) (objectcolor yellow_box_1 yellowtype) (objectcolor purple_ball_1 purpletype) (objectcolor yellow_box_2 yellowtype) (objectcolor yellow_door_1 yellowtype) (objectcolor purple_door_1 purpletype) (objectcolor red_door_1 redtype) (objectcolor grey_door_1 greytype) (emptyhands) (locked yellow_door_1) (locked purple_door_1) (locked red_door_1) (locked grey_door_1) (adjacentrooms room_2 room_1 yellow_door_1) (adjacentrooms room_1 room_2 yellow_door_1) (adjacentrooms room_3 room_1 purple_door_1) (adjacentrooms room_1 room_3 purple_door_1) (adjacentrooms room_4 room_2 red_door_1) (adjacentrooms room_2 room_4 red_door_1) (adjacentrooms room_4 room_3 grey_door_1) (adjacentrooms room_3 room_4 grey_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d greytype) (at_ ?d) (not (locked ?d))))))
 (:constraints (sometime (locked red_door_1)) (sometime-after (locked red_door_1) (or (carrying red_ball_2) (agentinroom room_1))) (always (not (agentinroom room_4))) (sometime (at_ grey_door_1)) (sometime-before (at_ grey_door_1) (or (not (emptyhands)) (carrying red_ball_4))) (sometime (agentinroom room_2)) (sometime-after (agentinroom room_2) (objectinroom red_ball_3 room_3)) (sometime (carrying red_ball_3)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor yellow_door_1 room_2 room_1)
   added: (at_ yellow_door_1)
   goals met: 0 of 1
2. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   goals met: 0 of 1
3. (gotodoor red_door_1 room_2 room_4)
   deleted: (at_ yellow_door_1)
   added: (at_ red_door_1)
   goals met: 0 of 1
4. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 1
5. (gotoobject red_ball_3 room_2)
   deleted: (at_ red_door_1)
   added: (at_ red_ball_3)
   goals met: 0 of 1
6. (pick red_ball_3 room_2)
   deleted: (at_ red_ball_3) (emptyhands) (objectinroom red_ball_3 room_2)
   added: (carrying red_ball_3)
   goals met: 0 of 1
7. (gotoroom room_2 room_1 yellow_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 1
8. (gotodoor purple_door_1 room_1 room_3)
   added: (at_ purple_door_1)
   goals met: 0 of 1
9. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 0 of 1
10. (gotoroom room_1 room_3 purple_door_1)
   deleted: (agentinroom room_1) (at_ purple_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
11. (gotoempty)
   added: (at_ empty)
   goals met: 0 of 1
12. (drop red_ball_3 room_3)
   deleted: (carrying red_ball_3) (at_ empty)
   added: (at_ red_ball_3) (emptyhands) (objectinroom red_ball_3 room_3)
   goals met: 0 of 1
13. (gotodoor grey_door_1 room_3 room_4)
   deleted: (at_ red_ball_3)
   added: (at_ grey_door_1)
   goals met: 0 of 1
14. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 1 of 1
